{
  "explicit_vocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "whimsical": 2,
    "moderate": 3,
    "family": 4,
    "linear": 5,
    "colorful": 6,
    "modern": 7,
    "buddy-comedy": 8,
    "adventure-comedy": 9,
    "family-adventure": 10,
    "fast": 11,
    "board-game-adventure": 12,
    "family-fantasy": 13,
    "magical-peril": 14,
    "humorous": 15,
    "general": 16,
    "ensemble": 17,
    "realistic": 18,
    "romantic-comedy": 19,
    "neighbor-rivalry": 20,
    "ensemble-comedy": 21,
    "dramatic": 22,
    "mature": 23,
    "ensemble-drama": 24,
    "female-centric": 25,
    "romantic-drama": 26,
    "family-comedy": 27,
    "domestic-comedy": 28,
    "sequel-comedy": 29,
    "intense": 30,
    "varied": 31,
    "gritty": 32,
    "heist-thriller": 33,
    "crime-drama": 34,
    "police-procedural": 35,
    "family-drama": 36,
    "class-conflict": 37,
    "19th century": 38,
    "childrens-adventure": 39,
    "coming-of-age": 40,
    "period-adventure": 41,
    "action-thriller": 42,
    "disaster-film": 43,
    "rescue-mission": 44,
    "tense": 45,
    "stylized": 46,
    "spy-thriller": 47,
    "action-adventure": 48,
    "techno-thriller": 49,
    "political-romance": 50,
    "political-drama": 51,
    "Victorian": 52,
    "parody": 53,
    "vampire-comedy": 54,
    "slapstick": 55,
    "uplifting": 56,
    "1920s": 57,
    "animated-adventure": 58,
    "historical-drama": 59,
    "character-study": 60,
    "1960s-1970s": 61,
    "biographical-drama": 62,
    "golden-age-of-piracy": 63,
    "swashbuckler": 64,
    "treasure-hunt": 65,
    "historical-adventure": 66,
    "1970s-1980s": 67,
    "gangster-thriller": 68,
    "neo-noir": 69,
    "melancholic": 70,
    "early 19th-century England": 71,
    "period-drama": 72,
    "dark": 73,
    "anthology": 74,
    "anthology-film": 75,
    "dark-comedy": 76,
    "suspense-thriller": 77,
    "slapstick-comedy": 78,
    "buddy-cop": 79,
    "crime-thriller": 80,
    "heist": 81,
    "crime-comedy": 82,
    "hollywood-satire": 83,
    "gangster-drama": 84,
    "psychological-thriller": 85,
    "serial-killer": 86,
    "professional-rivalry": 87,
    "mysterious": 88,
    "supernatural-drama": 89,
    "small-town-drama": 90,
    "slow": 91,
    "psychological-drama": 92,
    "romantic-tragedy": 93,
    "renaissance": 94,
    "tragedy": 95,
    "nonlinear": 96,
    "1970s": 97,
    "nostalgic-drama": 98,
    "cinephile": 99,
    "Regency-era": 100,
    "period-romance": 101,
    "literary-adaptation": 102,
    "drama": 103,
    "futuristic": 104,
    "dystopian-fantasy": 105,
    "steampunk": 106,
    "dark-fairy-tale": 107,
    "1930s": 108,
    "gangster-film": 109,
    "teacher-drama": 110,
    "inspirational-drama": 111,
    "urban-drama": 112,
    "time-travel": 113,
    "post-apocalyptic": 114,
    "early 20th century": 115,
    "aventure-romance": 116,
    "animal-fantasy": 117,
    "heartwarming-comedy": 118,
    "courtroom-drama": 119,
    "social-drama": 120,
    "serene": 121,
    "documentary-style": 122,
    "historical": 123,
    "historical-documentary": 124,
    "cultural-documentary": 125,
    "educational-documentary": 126,
    "body-swap": 127,
    "teen": 128,
    "1990s": 129,
    "teen-comedy": 130,
    "social-satire": 131,
    "apartheid-era": 132,
    "political-thriller": 133,
    "war-drama": 134,
    "social-realism": 135,
    "1660s": 136,
    "period-piece": 137,
    "court-intrigue": 138,
    "martial-arts": 139,
    "tournament-fighting": 140,
    "fantasy-action": 141,
    "satirical-drama": 142,
    "coming-of-age-drama": 143,
    "family-saga": 144,
    "early 1600s": 145,
    "historical-animation": 146,
    "musical-romance": 147,
    "queer-cinema": 148,
    "mystery-thriller": 149,
    "bodyguard-thriller": 150,
    "protective-drama": 151,
    "action-suspense": 152,
    "satirical-comedy": 153,
    "dramatic-comedy": 154,
    "road-movie": 155,
    "childrens-sports": 156,
    "underdog-story": 157,
    "southern-gothic": 158,
    "modern-fantasy": 159,
    "arthurian-adaptation": 160,
    "holiday-drama": 161,
    "slice-of-life": 162,
    "1950s": 163,
    "literary-drama": 164,
    "1950s and 1990s": 165,
    "psychological-mystery": 166,
    "magical-realism": 167,
    "coming-of-age-fantasy": 168,
    "revenge-thriller": 169,
    "maternal-drama": 170,
    "satire": 171,
    "urban-comedy": 172,
    "heist-comedy": 173,
    "sci-fi-comedy": 174,
    "cyberpunk": 175,
    "virtual-reality": 176,
    "vampire-horror": 177,
    "action-comedy": 178,
    "espionage": 179,
    "action-drama": 180,
    "coming-of-age-comedy": 181,
    "dramedy": 182,
    "musical-drama": 183,
    "melodrama": 184,
    "character-drama": 185,
    "comedy-drama": 186,
    "reunion-comedy": 187,
    "sci-fi-thriller": 188,
    "dystopian": 189,
    "technological-horror": 190,
    "1960s-1990s": 191,
    "biographical-documentary": 192,
    "music-documentary": 193,
    "art-documentary": 194,
    "revenge-drama": 195,
    "legal-thriller": 196,
    "romantic-thriller": 197,
    "post-WWII to late 20th century": 198,
    "feminist-drama": 199,
    "generational-drama": 200,
    "1940s-1950s": 201,
    "relationship-drama": 202,
    "Victorian England": 203,
    "1960s": 204,
    "survival-drama": 205,
    "nautical-adventure": 206,
    "animal-adventure": 207,
    "political-satire": 208,
    "race-against-time": 209,
    "19th-century": 210,
    "moral-drama": 211,
    "Victorian-era": 212,
    "gothic-horror": 213,
    "supernatural-comedy": 214,
    "urban-fantasy": 215,
    "military-thriller": 216,
    "nuclear-thriller": 217,
    "theatrical-comedy": 218,
    "holiday-comedy": 219,
    "urban-crime": 220,
    "true-crime-documentary": 221,
    "investigative-journalism": 222,
    "investigative-drama": 223,
    "buddy-film": 224,
    "domestic-thriller": 225,
    "suspense": 226,
    "sports-comedy": 227,
    "existential-comedy": 228,
    "18th-century": 229,
    "musical-comedy": 230,
    "pirate-fantasy": 231,
    "mid-1990s": 232,
    "fashion-documentary": 233,
    "behind-the-scenes": 234,
    "epic": 235,
    "medieval": 236,
    "historical-epic": 237,
    "biographical-action": 238,
    "legal-drama": 239,
    "1940s": 240,
    "rural-comedy": 241,
    "fish-out-of-water": 242,
    "holocaust-documentary": 243,
    "true-crime": 244,
    "inheritance-comedy": 245,
    "sports-drama": 246,
    "1970s-1990s": 247,
    "true-crime-drama": 248,
    "social-issue-drama": 249,
    "workplace-comedy": 250,
    "urban-melodrama": 251,
    "social-commentary": 252,
    "childrens-fantasy": 253,
    "adventure-fantasy": 254,
    "colonial-era": 255,
    "feminist-cinema": 256,
    "memory-drama": 257,
    "documentary-portrait": 258,
    "psychological-documentary": 259,
    "urban-study": 260,
    "small-town-comedy": 261,
    "lighthearted-comedy": 262,
    "emotional-drama": 263,
    "post-World War II Ireland (1940s-1950s)": 264,
    "immigrant-comedy": 265,
    "documentary": 266,
    "culture-study": 267,
    "media-critique": 268,
    "military-comedy": 269,
    "underdog-comedy": 270,
    "mid-20th-century": 271,
    "investigative-documentary": 272,
    "profile-documentary": 273,
    "religious-drama": 274,
    "espionage-thriller": 275,
    "crime-action": 276,
    "career-drama": 277,
    "journalism-drama": 278,
    "social-comedy": 279,
    "late 1980s": 280,
    "1980s": 281,
    "faith-based": 282,
    "animal-rescue": 283,
    "wilderness-survival": 284,
    "addiction-drama": 285,
    "post-World War II": 286,
    "theatrical-drama": 287,
    "space-thriller": 288,
    "18th century": 289,
    "rebellion-epic": 290,
    "psychological-horror": 291,
    "academic-drama": 292,
    "superhero-action": 293,
    "erotic-drama": 294,
    "surrealist": 295,
    "survival-thriller": 296,
    "character-driven": 297,
    "mockumentary": 298,
    "farce": 299,
    "ghost-comedy": 300,
    "supernatural-adventure": 301,
    "jungle-adventure": 302,
    "creature-feature": 303,
    "expedition-thriller": 304,
    "submarine-drama": 305,
    "crisis-thriller": 306,
    "action-romance": 307,
    "hardboiled-detective": 308,
    "period-thriller": 309,
    "teen-drama": 310,
    "arthurian-legend": 311,
    "historical-romance": 312,
    "animal-drama": 313,
    "environmental-thriller": 314,
    "cyber-thriller": 315,
    "teen-rebellion": 316,
    "techno-crime": 317,
    "tech-thriller": 318,
    "dystopian-action": 319,
    "cyberpunk-action": 320,
    "dystopian-thriller": 321,
    "law-enforcement-drama": 322,
    "courtroom-comedy": 323,
    "meta-film": 324,
    "independent-cinema": 325,
    "supernatural-horror": 326,
    "occult-thriller": 327,
    "slacker-comedy": 328,
    "sci-fi-fantasy": 329,
    "grief-drama": 330,
    "horror-thriller": 331,
    "surreal-drama": 332,
    "existential-drama": 333,
    "conspiracy-thriller": 334,
    "pregnancy-comedy": 335,
    "indie-comedy": 336,
    "detective-thriller": 337,
    "occult": 338,
    "character-comedy": 339,
    "medical-drama": 340,
    "17th-century": 341,
    "cultural-studies": 342,
    "sci-fi-horror": 343,
    "thriller": 344,
    "cyberpunk-thriller": 345,
    "home-invasion-thriller": 346,
    "family-thriller": 347,
    "mystery-drama": 348,
    "drag-comedy": 349,
    "disaster": 350,
    "creative-process": 351,
    "survival-adventure": 352,
    "alternate-history": 353,
    "late 19th century": 354,
    "historical-western": 355,
    "biographical": 356,
    "anthology-drama": 357,
    "dialogue-driven": 358,
    "female-bonding": 359,
    "friendship-drama": 360,
    "family-horror": 361,
    "coming-of-age-romance": 362,
    "corporate-thriller": 363,
    "adventure": 364,
    "mystery": 365,
    "culinary-drama": 366,
    "undercover-caper": 367,
    "biographical-comedy": 368,
    "showbiz-drama": 369,
    "travel-adventure": 370,
    "animal-bond": 371,
    "father-son-comedy": 372,
    "road-trip-adventure": 373,
    "animated-musical": 374,
    "supernatural-thriller": 375,
    "fantasy-drama": 376,
    "reincarnation-fantasy": 377,
    "historical-musical": 378,
    "timeless": 379,
    "stop-motion-animation": 380,
    "police-drama": 381,
    "sports-documentary": 382,
    "coming-of-age-documentary": 383,
    "social-issue-documentary": 384,
    "con-artist-comedy": 385,
    "mistaken-identity": 386,
    "late 18th to early 19th century": 387,
    "manhunt": 388,
    "military-action": 389,
    "screwball-comedy": 390,
    "intellectual-comedy": 391,
    "historical-spanning": 392,
    "1780s": 393,
    "prank-comedy": 394,
    "body-swap-comedy": 395,
    "investigative-mystery": 396,
    "time-travel-fantasy": 397,
    "space-opera": 398,
    "heroic-fantasy": 399,
    "adventure-epic": 400,
    "World War I era (1910s)": 401,
    "childrens-drama": 402,
    "early-1900s": 403,
    "early-20th-century": 404,
    "gang-drama": 405,
    "tragic-romance": 406,
    "late 18th century": 407,
    "gothic": 408,
    "late-18th-century": 409,
    "tragic-drama": 410,
    "christmas-drama": 411,
    "1920s-1990s": 412,
    "immigrant-narrative": 413,
    "prison-drama": 414,
    "courtroom-thriller": 415,
    "redemption-drama": 416,
    "street-drama": 417,
    "youth-rebellion": 418,
    "urban-action": 419,
    "post-apocalyptic-sci-fi": 420,
    "assassin-thriller": 421,
    "travel-romance": 422,
    "fate-romance": 423,
    "domestic-drama": 424,
    "erotic-thriller": 425,
    "medical-thriller": 426,
    "suspense-drama": 427,
    "hitman-thriller": 428,
    "mentor-drama": 429,
    "revenge-crime": 430,
    "immigrant-drama": 431,
    "quirky-comedy": 432,
    "black-comedy": 433,
    "culture-clash": 434,
    "investigative-thriller": 435,
    "1910s": 436,
    "immigrant-story": 437,
    "1570s France": 438,
    "late 1800s": 439,
    "revenge-western": 440,
    "gunfighter-tournament": 441,
    "female-protagonist": 442,
    "college-comedy": 443,
    "fashion-drama": 444,
    "art-house": 445,
    "philosophical-drama": 446,
    "minimalist": 447,
    "psychic-thriller": 448,
    "fairy-tale": 449,
    "musical-animation": 450,
    "folklore-fantasy": 451,
    "sci-fi-adventure": 452,
    "ancient-mystery": 453,
    "1940s-1960s": 454,
    "identity-drama": 455,
    "workplace-drama": 456,
    "1940s-1970s": 457,
    "post-apocalyptic-action": 458,
    "rebellion-musical": 459,
    "demonic-possession": 460,
    "action-horror": 461,
    "crossover-film": 462,
    "urban-horror": 463,
    "anthology-horror": 464,
    "marriage-drama": 465,
    "body-horror": 466,
    "business-comedy": 467,
    "meta-cinema": 468,
    "wartime": 469,
    "holiday-romance": 470,
    "feel-good": 471,
    "cultural-drama": 472,
    "detective-comedy": 473,
    "lgbtq-drama": 474,
    "music-drama": 475,
    "period-comedy": 476,
    "showbiz-satire": 477,
    "gangster-comedy": 478,
    "supernatural-action": 479,
    "gothic-romance": 480,
    "prehistoric-modern": 481,
    "live-action-cartoon": 482,
    "1940s-1980s": 483,
    "british-comedy": 484,
    "college-drama": 485,
    "20th-century": 486,
    "artistic-documentary": 487,
    "dual-era (ancient/modern)": 488,
    "spiritual-drama": 489,
    "meta-narrative": 490,
    "meta-horror": 491,
    "superhero-comedy": 492,
    "crime-fantasy": 493,
    "Old West": 494,
    "western-comedy": 495,
    "buddy-western": 496,
    "early-1990s": 497,
    "adventure-thriller": 498,
    "disaster-thriller": 499,
    "time-travel-thriller": 500,
    "sci-fi-action": 501,
    "werewolf-horror": 502,
    "late-1800s": 503,
    "biographical-western": 504,
    "epic-western": 505,
    "buddy-action": 506,
    "media-satire": 507,
    "Napoleonic era": 508,
    "exploitation": 509,
    "camp": 510,
    "stop-motion-fantasy": 511,
    "surreal-adventure": 512,
    "video-game-adaptation": 513,
    "independent-drama": 514,
    "survival-horror": 515,
    "amnesia-thriller": 516,
    "wilderness-comedy": 517,
    "sword-fighting": 518,
    "fantasy-adventure": 519,
    "working-class-drama": 520,
    "cosmic-horror": 521,
    "meta-fiction": 522,
    "stand-up-comedy": 523,
    "comedy-special": 524,
    "performance-film": 525,
    "1870s": 526,
    "music-comedy": 527,
    "late-19th-century": 528,
    "revisionist-western": 529,
    "multiple-historical-periods": 530,
    "ethical-drama": 531,
    "institutional-critique": 532,
    "marital-drama": 533,
    "alien-invasion": 534,
    "paranoia-thriller": 535,
    "obsession-drama": 536,
    "amnesia-mystery": 537,
    "mountain-adventure": 538,
    "survival-action": 539,
    "alien-comedy": 540,
    "police-comedy": 541,
    "political-comedy": 542,
    "surfing-documentary": 543,
    "travel-documentary": 544,
    "feminist-comedy": 545,
    "counterculture-drama": 546,
    "noir-comedy": 547,
    "20th-century China": 548,
    "martial-arts-drama": 549,
    "redemption-story": 550,
    "romantic-mystery": 551,
    "family-secrets": 552,
    "chase-thriller": 553,
    "wrongful-conviction": 554,
    "1880s": 555,
    "war-western": 556,
    "revenge-comedy": 557,
    "independent-film": 558,
    "lesbian-romance": 559,
    "urban-survival": 560,
    "1960s-1980s": 561,
    "war-satire": 562,
    "historical-comedy": 563,
    "community-drama": 564,
    "party-comedy": 565,
    "youth-comedy": 566,
    "corporate-satire": 567,
    "showbiz-comedy": 568,
    "crime": 569,
    "dinosaur-thriller": 570,
    "heist-film": 571,
    "journey-narrative": 572,
    "American Old West": 573,
    "outlaw-western": 574,
    "comedy-adventure": 575,
    "drama-thriller": 576,
    "mentorship-drama": 577,
    "detective-story": 578,
    "urban-mystery": 579,
    "awkward-comedy": 580,
    "shakespearean-adaptation": 581,
    "disguise-comedy": 582,
    "prison-break": 583,
    "multiple-centuries": 584,
    "gender-exploration": 585,
    "college-football": 586,
    "government-conspiracy": 587,
    "murder-mystery": 588,
    "hostage-drama": 589,
    "interwar period (1920s-1930s)": 590,
    "corporate-drama": 591,
    "dystopian-sci-fi": 592,
    "swashbuckler-comedy": 593,
    "gang-violence": 594,
    "buddy-drama": 595,
    "satirical-horror": 596,
    "crime-satire": 597,
    "superhero": 598,
    "pulp-fiction": 599,
    "philosophical-sci-fi": 600,
    "hunting-thriller": 601,
    "experimental-cinema": 602,
    "musical-portrait": 603,
    "timeless-fantasy": 604,
    "dark-fantasy": 605,
    "holiday-musical": 606,
    "17th century": 607,
    "action-western": 608,
    "romantic-action": 609,
    "political-documentary": 610,
    "campaign-documentary": 611,
    "neorealist": 612,
    "live-action-animation": 613,
    "literary-fantasy": 614,
    "early 1990s": 615,
    "travel-comedy": 616,
    "rural-drama": 617,
    "labor-drama": 618,
    "cultural-comedy": 619,
    "childrens-comedy": 620,
    "situational-comedy": 621,
    "animal-friendship": 622,
    "coastal-drama": 623,
    "15th-century": 624,
    "supernatural-mystery": 625,
    "mafia-drama": 626,
    "1810s": 627,
    "historical-analysis": 628,
    "film-studies": 629,
    "culture-clash-comedy": 630,
    "autobiographical-comedy": 631,
    "supernatural-romance": 632,
    "comedy-thriller": 633,
    "paranormal-mystery": 634,
    "1860s": 635,
    "frontier-western": 636,
    "cultural-exploration": 637,
    "musical-fantasy": 638,
    "animated-classic": 639,
    "romantic-fantasy": 640,
    "moral-fable": 641,
    "cinderella-story": 642,
    "class-drama": 643,
    "fantasy-comedy": 644,
    "ensemble-western": 645,
    "sociological-documentary": 646,
    "slasher": 647,
    "urban-legend": 648,
    "20th century": 649,
    "animated-anthology": 650,
    "fantasy-horror": 651,
    "Victorian era": 652,
    "cabin-horror": 653,
    "animal-comedy": 654,
    "adventure-drama": 655,
    "contemporary-romance": 656,
    "dinner-party-drama": 657,
    "historical-war": 658,
    "relationship-comedy": 659,
    "transgressive": 660,
    "military-drama": 661,
    "war-film": 662,
    "action-mystery": 663,
    "surreal-comedy": 664,
    "sci-fi-mystery": 665,
    "dystopian-drama": 666,
    "sword-and-sorcery": 667,
    "buddy-fantasy": 668,
    "medieval-adventure": 669,
    "personal-growth": 670,
    "identity-theft": 671,
    "musical-adventure": 672,
    "science-fiction-parody": 673,
    "heritage-drama": 674,
    "animated-live-action": 675,
    "erotic-sci-fi": 676,
    "psychedelic-adventure": 677,
    "noir-thriller": 678,
    "colonial-drama": 679,
    "meta-documentary": 680,
    "film-history": 681,
    "war-documentary": 682,
    "terminal-illness-drama": 683,
    "Vietnam War era (1960s)": 684,
    "war-comedy": 685,
    "military-adventure": 686,
    "mistaken-identity-comedy": 687,
    "romantic-farce": 688,
    "military-sci-fi": 689,
    "android-drama": 690,
    "trauma-drama": 691,
    "undercover-investigation": 692,
    "ancient-rome": 693,
    "fanaticism-comedy": 694,
    "environmental-drama": 695,
    "captivity-drama": 696,
    "acid-western": 697,
    "surreal-western": 698,
    "philosophical-western": 699,
    "1830s": 700,
    "gang-crime": 701,
    "career-comedy": 702,
    "medieval and modern": 703,
    "time-travel-comedy": 704,
    "stop-motion": 705,
    "compilation": 706,
    "comedy": 707,
    "cult-cinema": 708,
    "oral-history": 709,
    "allegorical-drama": 710,
    "blaxploitation": 711,
    "zombie-comedy": 712,
    "surreal-horror": 713,
    "summer-comedy": 714,
    "philosophical-thriller": 715,
    "tech-noir": 716,
    "spoof-comedy": 717,
    "social-realist": 718,
    "mystery-comedy": 719,
    "thriller-parody": 720,
    "post-war-drama": 721,
    "cold-war-drama": 722,
    "timeless/period-ambiguous": 723,
    "absurdist": 724,
    "teen-adventure": 725,
    "post-colonial India": 726,
    "1930s-1950s": 727,
    "ancient-china": 728,
    "symbolic-drama": 729,
    "fantasy": 730,
    "celebrity-profile": 731,
    "cultural-history": 732,
    "gender-comedy": 733,
    "post-colonial-drama": 734,
    "african-cinema": 735,
    "traditional-era": 736,
    "drug-drama": 737,
    "ensemble-romance": 738,
    "art-house-drama": 739,
    "15th century": 740,
    "gothic-drama": 741,
    "social-documentary": 742,
    "intellectual-drama": 743,
    "timeless/folklore": 744,
    "magical-adventure": 745,
    "drama-comedy": 746,
    "drama-romance": 747,
    "eccentric-comedy": 748,
    "rescue-action": 749,
    "ghost-story": 750,
    "neo-western": 751,
    "family-mystery": 752,
    "sci-fi-drama": 753,
    "urban-romance": 754,
    "heist-drama": 755,
    "escape-thriller": 756,
    "gay-themed": 757,
    "road-comedy": 758,
    "rebellion-drama": 759,
    "gritty-drama": 760,
    "radio-drama": 761,
    "sitcom-adaptation": 762,
    "desert-noir": 763,
    "1820s": 764,
    "bromance": 765,
    "women-centric": 766,
    "live-action-fantasy": 767,
    "social-justice": 768,
    "school-comedy": 769,
    "beach-comedy": 770,
    "vampire": 771,
    "post-apocalyptic-adventure": 772,
    "urban-grit": 773,
    "art-drama": 774,
    "artistic-journey": 775,
    "gangster-epic": 776,
    "whimsical-comedy": 777,
    "artistic-drama": 778,
    "marital-comedy": 779,
    "comedy-of-errors": 780,
    "life-crisis": 781,
    "mad-scientist": 782,
    "societal-collapse": 783,
    "musician-drama": 784,
    "prehistoric": 785,
    "psychological-romance": 786,
    "cult-thriller": 787,
    "romantic-war": 788,
    "romantic-musical": 789,
    "backstage-drama": 790,
    "fashion-musical": 791,
    "suspense-mystery": 792,
    "gaslighting-drama": 793,
    "domestic-suspense": 794,
    "workplace-satire": 795,
    "cross-dressing-comedy": 796,
    "caper-comedy": 797,
    "mystery-romance": 798,
    "wartime-romance": 799,
    "classic-noir": 800,
    "Edwardian-era": 801,
    "classic-musical": 802,
    "classic-romance": 803,
    "social-class-drama": 804,
    "1900s": 805,
    "family-musical": 806,
    "period-musical": 807,
    "epic-romance": 808,
    "late-19th-to-early-20th-century": 809,
    "existential-thriller": 810,
    "war-espionage": 811,
    "romantic-adventure": 812,
    "war-thriller": 813,
    "romantic-noir": 814,
    "romantic-suspense": 815,
    "film-noir": 816,
    "suspense-romance": 817,
    "backstage-musical": 818,
    "sophisticated-comedy": 819,
    "Belle Époque Paris (late 19th century)": 820,
    "detective-noir": 821,
    "utopian-fantasy": 822,
    "classic-hollywood": 823,
    "resistance-drama": 824,
    "mid-20th century": 825,
    "western-drama": 826,
    "detective-mystery": 827,
    "whodunit": 828,
    "newspaper-drama": 829,
    "idealistic-drama": 830,
    "classic-comedy": 831,
    "backstage-mystery": 832,
    "moral-fantasy": 833,
    "fugitive-drama": 834,
    "classic-western": 835,
    "romantic-western": 836,
    "redemption-western": 837,
    "man-on-the-run": 838,
    "combat-drama": 839,
    "outlaw-drama": 840,
    "zombie-horror": 841,
    "river-adventure": 842,
    "missionary-drama": 843,
    "World War I (1910s)": 844,
    "war-romance": 845,
    "inspirational-documentary": 846,
    "biographical-war": 847,
    "Prohibition-era (1920s-1930s)": 848,
    "gangster-western": 849,
    "deception-comedy": 850,
    "early-1800s": 851,
    "supernatural-fantasy": 852,
    "childrens-mystery": 853,
    "sentient-vehicle": 854,
    "reunion-story": 855,
    "1800s": 856,
    "pirates": 857,
    "sea-adventure": 858,
    "inspirational-comedy": 859,
    "true-story-comedy": 860,
    "animated-short": 861,
    "travelogue": 862,
    "animated-fantasy": 863,
    "childrens-musical": 864,
    "circus-drama": 865,
    "rural-america-early-20th-century": 866,
    "christmas-action": 867,
    "hostage-crisis": 868,
    "technology-exploration": 869,
    "philosophical-documentary": 870,
    "ethnic-comedy": 871,
    "lgbtq-romance": 872,
    "amnesia-drama": 873,
    "historical-action": 874,
    "documentary-drama": 875,
    "literary-analysis": 876,
    "modern-shakespeare": 877,
    "drama-adaptation": 878,
    "bromantic-comedy": 879,
    "fantasy-quest": 880,
    "crime-mystery": 881,
    "investigation-thriller": 882,
    "crime-noir": 883,
    "exotic-adventure": 884,
    "dystopian-satire": 885,
    "political-farce": 886,
    "absurdist-comedy": 887,
    "1st century Judea": 888,
    "religious-satire": 889,
    "gender-bender-comedy": 890,
    "early 1900s": 891,
    "period-crime": 892,
    "man-vs-nature": 893,
    "domestic-noir": 894,
    "opera-film": 895,
    "dance-musical": 896,
    "summer-romance": 897,
    "psychological-war": 898,
    "musical-biopic": 899,
    "holocaust-drama": 900,
    "alien-friendship": 901,
    "childhood-fantasy": 902,
    "possession-horror": 903,
    "small-town-horror": 904,
    "nature-documentary": 905,
    "wildlife": 906,
    "educational": 907,
    "environmental": 908,
    "macro-photography": 909,
    "observational": 910,
    "corporate-comedy": 911,
    "gender-role-comedy": 912,
    "impersonation-comedy": 913,
    "19th-century American West": 914,
    "frontier-adventure": 915,
    "1940s-1990s": 916,
    "environmental-documentary": 917,
    "psychological-fantasy": 918,
    "deep-sea-adventure": 919,
    "mystery-action": 920,
    "prison-escape": 921,
    "hostage-thriller": 922,
    "historical-parody": 923,
    "faith-based-drama": 924,
    "interpersonal-drama": 925,
    "philosophical-comedy": 926,
    "extreme-sports": 927,
    "adventure-documentary": 928,
    "comedy-short": 929,
    "autobiographical-documentary": 930,
    "art-film": 931,
    "16th century": 932,
    "animated-thriller": 933,
    "faith-drama": 934,
    "1930s-1940s": 935,
    "political-allegory": 936,
    "experimental-drama": 937,
    "labor-documentary": 938,
    "nostalgic-comedy": 939,
    "identity-comedy": 940,
    "World War I": 941,
    "anti-war": 942,
    "con-artist": 943,
    "disability-drama": 944,
    "dance-drama": 945,
    "late-1980s": 946,
    "cultural-study": 947,
    "lgbtq-cinema": 948,
    "institutional-drama": 949,
    "stoner-comedy": 950,
    "archaeological-thriller": 951,
    "bureaucratic-thriller": 952,
    "spaghetti-western": 953,
    "World War I era": 954,
    "desert-adventure": 955,
    "animated-action": 956,
    "sci-fi-war": 957,
    "dystopian-fiction": 958,
    "post-war 1940s": 959,
    "post-war-thriller": 960,
    "crime-biopic": 961,
    "monster-movie": 962,
    "horror-comedy": 963,
    "time-travel-adventure": 964,
    "feudal-japan": 965,
    "samurai-epic": 966,
    "early 20th century to 1950s": 967,
    "crime-epic": 968,
    "war-epic": 969,
    "1920s-1960s": 970,
    "neurotic-comedy": 971,
    "introspective-comedy": 972,
    "1950s-1960s": 973,
    "submarine-warfare": 974,
    "crime-caper": 975,
    "indie-drama": 976,
    "fish-out-of-water-comedy": 977,
    "splatstick": 978,
    "meta-theatrical": 979,
    "gangster": 980,
    "border-thriller": 981,
    "prisoner-of-war": 982,
    "surrealist-drama": 983,
    "cold-war-allegory": 984,
    "message-film": 985,
    "western": 986,
    "splatter-comedy": 987,
    "low-budget-horror": 988,
    "serial-killer-thriller": 989,
    "splatstick-horror": 990,
    "time-loop-comedy": 991,
    "drama-western": 992,
    "counterculture": 993,
    "gothic-comedy": 994,
    "deadpan-comedy": 995,
    "classical-music": 996,
    "suspense-western": 997,
    "1912": 998,
    "time-travel-romance": 999,
    "ancient Rome": 1000,
    "sword-and-sandal": 1001,
    "rock-music-comedy": 1002,
    "experimental-documentary": 1003,
    "visual-symphony": 1004,
    "non-narrative": 1005,
    "archaeology-adventure": 1006,
    "historical-thriller": 1007,
    "early-to-mid 20th century": 1008,
    "Edwardian era": 1009,
    "rock-opera": 1010,
    "surreal-musical": 1011,
    "monster-horror": 1012,
    "technological-thriller": 1013,
    "outlaw-adventure": 1014,
    "sci-fi-road-movie": 1015,
    "futuristic-thriller": 1016,
    "misadventure-comedy": 1017,
    "intimate-drama": 1018,
    "real-life-drama": 1019,
    "urban-portrait": 1020,
    "haunted-object": 1021,
    "time-manipulation": 1022,
    "haunted-house": 1023,
    "paranormal-thriller": 1024,
    "camp-horror": 1025,
    "cult-horror": 1026,
    "natural-horror": 1027,
    "b-movie": 1028,
    "eco-horror": 1029,
    "crime-horror": 1030,
    "period-horror": 1031,
    "silent-film": 1032,
    "academic-romance": 1033,
    "investigative": 1034,
    "arctic-adventure": 1035,
    "1690s": 1036,
    "live-action-remake": 1037,
    "first-contact": 1038,
    "crew-adventure": 1039,
    "eco-sci-fi": 1040,
    "ensemble-adventure": 1041,
    "superhero-noir": 1042,
    "gothic-action": 1043,
    "teen-musical": 1044,
    "high-school-comedy": 1045,
    "social-realist-drama": 1046,
    "1750s": 1047,
    "biographical-musical": 1048,
    "concert-film": 1049,
    "martial-arts-comedy": 1050,
    "vigilante-action": 1051,
    "late-life-romance": 1052,
    "wartime-adventure": 1053,
    "scientific-documentary": 1054,
    "humanitarian-drama": 1055,
    "pregnancy-drama": 1056,
    "social-issue": 1057,
    "true-story": 1058,
    "undercover-thriller": 1059,
    "mob-drama": 1060,
    "heist-crime": 1061,
    "biopic": 1062,
    "artistic-romance": 1063,
    "arctic-noir": 1064,
    "working-class-comedy": 1065,
    "introspective-drama": 1066,
    "campus-drama": 1067,
    "team-adventure": 1068,
    "19th-century Russia": 1069,
    "jungle-thriller": 1070,
    "dark-romance": 1071,
    "mob-comedy": 1072,
    "war-survival": 1073,
    "female-friendship-comedy": 1074,
    "spy-spoof": 1075,
    "desert-thriller": 1076,
    "fantasy-realm": 1077,
    "kung-fu-fantasy": 1078,
    "portal-fantasy": 1079,
    "gay-cinema": 1080,
    "adventure-survival": 1081,
    "experimental": 1082,
    "animal-story": 1083,
    "legal-comedy": 1084,
    "animal-bonding": 1085,
    "heartwarming-drama": 1086,
    "midlife-comedy": 1087,
    "contemplative-drama": 1088,
    "comic-book-adaptation": 1089,
    "villain-team-up": 1090,
    "life-affirming": 1091,
    "ancient": 1092,
    "mythological-adventure": 1093,
    "crime-procedural": 1094,
    "chick-flick": 1095,
    "cinema-about-cinema": 1096,
    "body-swap-thriller": 1097,
    "high-concept-action": 1098,
    "identity-crime": 1099,
    "poetic-drama": 1100,
    "coming-of-age-adventure": 1101,
    "gender-equality-drama": 1102,
    "police-corruption": 1103,
    "space-horror": 1104,
    "eco-thriller": 1105,
    "paranoid-thriller": 1106,
    "vigilante": 1107,
    "gangster-crime": 1108,
    "ancient-mythical": 1109,
    "social-thriller": 1110,
    "cold-war": 1111,
    "cold-war-thriller": 1112,
    "wilderness-adventure": 1113,
    "mind-game": 1114,
    "small-town": 1115,
    "indie-romance": 1116,
    "royal-biopic": 1117,
    "teen-horror": 1118,
    "underworld-thriller": 1119,
    "philosophical": 1120,
    "bioethical-thriller": 1121,
    "period-mystery": 1122,
    "exploratory": 1123,
    "media-thriller": 1124,
    "dance-film": 1125,
    "late-1970s-to-early-1980s": 1126,
    "identity-thriller": 1127,
    "satirical-action": 1128,
    "parallel-universe": 1129,
    "assassination-thriller": 1130,
    "cat-and-mouse": 1131,
    "historical-fantasy": 1132,
    "spy-comedy": 1133,
    "fantasy-romance": 1134,
    "workplace-thriller": 1135,
    "small-town-thriller": 1136,
    "disaster-drama": 1137,
    "thriller-drama": 1138,
    "healing-drama": 1139,
    "spiritual-journey": 1140,
    "gender-identity-drama": 1141,
    "childrens-action": 1142,
    "urban-thriller": 1143,
    "1930s-1990s": 1144,
    "intellectual-history": 1145,
    "timeless-futuristic": 1146,
    "love-triangle": 1147,
    "superhero-origin": 1148,
    "disaster-action": 1149,
    "apocalyptic": 1150,
    "religious-thriller": 1151,
    "fallen-angel-drama": 1152,
    "contemporary-drama": 1153,
    "16th-century": 1154,
    "pop-music-comedy": 1155,
    "celebrity-satire": 1156,
    "assassin-drama": 1157,
    "crime-romance": 1158,
    "exile-drama": 1159,
    "medical-documentary": 1160,
    "surfing-adventure": 1161,
    "disaster-documentary": 1162,
    "historical-reconstruction": 1163,
    "kidnapping-suspense": 1164,
    "historical-crime": 1165,
    "tragic-comedy": 1166,
    "spiritual-comedy": 1167,
    "drama-of-manners": 1168,
    "obsession-comedy": 1169,
    "space-adventure": 1170,
    "con-game": 1171,
    "early 1980s": 1172,
    "kitchen-sink": 1173,
    "quest": 1174,
    "late-1990s": 1175,
    "industry-satire": 1176,
    "meta-comedy": 1177,
    "academic-comedy": 1178,
    "alien-horror": 1179,
    "post-war": 1180,
    "youth-ensemble": 1181,
    "early 19th century France": 1182,
    "apocalyptic-action": 1183,
    "quest-narrative": 1184,
    "drug-comedy": 1185,
    "early 1800s": 1186,
    "survival-comedy": 1187,
    "1840s": 1188,
    "1798-1801 (Napoleonic era)": 1189,
    "youth-drama": 1190,
    "1900": 1191,
    "australian-gothic": 1192,
    "indigenous-cinema": 1193,
    "autobiographical": 1194,
    "school-drama": 1195,
    "mind-bending": 1196,
    "sister-drama": 1197,
    "showbiz-story": 1198,
    "frontier-epic": 1199,
    "1899-1930s": 1200,
    "naval-adventure": 1201,
    "mutiny-thriller": 1202,
    "musical": 1203,
    "home-front-drama": 1204,
    "wartime-family-drama": 1205,
    "historical-war-drama": 1206,
    "veteran-story": 1207,
    "issue-drama": 1208,
    "gang-conflict": 1209,
    "generational-saga": 1210,
    "biographical-romance": 1211,
    "1948-1973": 1212,
    "punk-comedy": 1213,
    "sci-fi-satire": 1214,
    "cult-classic": 1215,
    "revenge": 1216,
    "holiday-horror": 1217,
    "haunting-thriller": 1218,
    "1820s-1840s": 1219,
    "1885": 1220,
    "sci-fi-western": 1221,
    "fantasy-timeless": 1222,
    "animated-drama": 1223,
    "spiritual-thriller": 1224,
    "existential-mystery": 1225,
    "controversial-drama": 1226,
    "military-epic": 1227,
    "heroic-quest": 1228,
    "comedy-mystery": 1229,
    "wildlife-drama": 1230,
    "superhero-parody": 1231,
    "cold-war-adventure": 1232,
    "irish-folklore": 1233,
    "alien-encounter": 1234,
    "holiday-film": 1235,
    "comedy-western": 1236,
    "making-of": 1237,
    "film-industry": 1238,
    "satirical-documentary": 1239,
    "1910s-1920s": 1240,
    "suburban-comedy": 1241,
    "road-trip-comedy": 1242,
    "jungle-fantasy": 1243,
    "kidnapping-drama": 1244,
    "childrens-thriller": 1245,
    "animated-romance": 1246,
    "1890s": 1247,
    "animated-comedy": 1248,
    "holiday-fantasy": 1249,
    "family-sci-fi": 1250,
    "animated-sequel": 1251,
    "pulp-action": 1252,
    "live-action-animal": 1253,
    "post-Civil War South": 1254,
    "early-1600s": 1255,
    "biographical-adventure": 1256,
    "classic-animation": 1257,
    "gladiatorial": 1258,
    "film-noir-parody": 1259,
    "crime-spoof": 1260,
    "workplace-horror": 1261,
    "pulp-adventure": 1262,
    "epic-quest": 1263,
    "animal-horror": 1264,
    "rural-thriller": 1265,
    "gothic-humor": 1266,
    "Renaissance France": 1267,
    "fairy-tale-adaptation": 1268,
    "ethnographic-documentary": 1269,
    "urban-adventure": 1270,
    "character-transformation": 1271,
    "rural-1950s": 1272,
    "dramatic-fable": 1273,
    "animal-fable": 1274,
    "fantasy-medieval": 1275,
    "puppet-animation": 1276,
    "animated-western": 1277,
    "teen-romance": 1278,
    "high-school-drama": 1279,
    "tribal-conflict": 1280,
    "desert-comedy": 1281,
    "international-intrigue": 1282,
    "self-discovery": 1283,
    "historical-fiction": 1284,
    "quest-adventure": 1285,
    "cult-exploitation": 1286,
    "superhero-horror": 1287,
    "vampire-action": 1288,
    "competition-drama": 1289,
    "boarding-school-comedy": 1290,
    "caper-thriller": 1291,
    "suspense-comedy": 1292,
    "late 1970s": 1293,
    "adult-animation": 1294,
    "1950s-1990s": 1295,
    "domestic-horror": 1296,
    "wrong-man-thriller": 1297,
    "wrongful-accusation": 1298,
    "investigation-drama": 1299,
    "con-artist-drama": 1300,
    "musical-revue": 1301,
    "comedy-sketch": 1302,
    "variety-show": 1303,
    "silent-comedy": 1304,
    "silent-drama": 1305,
    "mountain-drama": 1306,
    "poker-drama": 1307,
    "late 1990s": 1308,
    "dramatic-satire": 1309,
    "satirical-thriller": 1310,
    "absurdist-humor": 1311,
    "medical-comedy": 1312,
    "ninja-action": 1313,
    "vacation-comedy": 1314,
    "apocalyptic-thriller": 1315,
    "moral-dilemma": 1316,
    "1890s-1990s": 1317,
    "documentary-history": 1318,
    "cinema-studies": 1319,
    "film-retrospective": 1320,
    "buddy-road-movie": 1321,
    "samurai-action": 1322,
    "small-town-crime": 1323,
    "surreal": 1324,
    "boarding-school-drama": 1325,
    "atomic-age-horror": 1326,
    "hollywood-drama": 1327,
    "gothic-fantasy": 1328,
    "satirical-fantasy": 1329,
    "impostor-comedy": 1330,
    "afterlife-drama": 1331,
    "sketch-comedy": 1332,
    "artistic-portrait": 1333,
    "relationship-study": 1334,
    "mystery-sci-fi": 1335,
    "human-drama": 1336,
    "post-Civil War America": 1337,
    "witchcraft-fantasy": 1338,
    "conspiracy-comedy": 1339,
    "character-driven-comedy": 1340,
    "urban-exploration": 1341,
    "tragicomedy": 1342,
    "adult-comedy": 1343,
    "noir": 1344,
    "vampire-thriller": 1345,
    "competition-documentary": 1346,
    "endurance-documentary": 1347,
    "character-study-documentary": 1348,
    "street-life": 1349,
    "biographical-fiction": 1350,
    "neorealist-drama": 1351,
    "drama-of-revelation": 1352,
    "cult-comedy": 1353,
    "transgressive-comedy": 1354,
    "camp-comedy": 1355,
    "docudrama": 1356,
    "kaiju": 1357,
    "monster-disaster": 1358,
    "city-destruction": 1359,
    "suburban-drama": 1360,
    "cultural-conflict": 1361,
    "investigative-comedy": 1362,
    "revenge-fantasy": 1363,
    "apocalyptic-sci-fi": 1364,
    "institutional-satire": 1365,
    "media-drama": 1366,
    "cultural-discovery": 1367,
    "horror-mystery": 1368,
    "ancient-egypt": 1369,
    "biblical-epic": 1370,
    "Elizabethan-era": 1371,
    "christmas-fantasy": 1372,
    "holiday-adventure": 1373,
    "war-veteran-drama": 1374,
    "boxing-film": 1375,
    "whodunit-mystery": 1376,
    "teen-detective": 1377,
    "home-invasion": 1378,
    "cyber-romance": 1379,
    "wildlife-fantasy": 1380,
    "monster-film": 1381,
    "road-thriller": 1382,
    "haunted-location": 1383,
    "splatter": 1384,
    "cannibal-horror": 1385,
    "1850s": 1386,
    "historical-mystery": 1387,
    "geriatric-comedy": 1388,
    "mentorship": 1389,
    "action-war": 1390,
    "training-narrative": 1391,
    "satirical-western": 1392,
    "apocalyptic-horror": 1393,
    "documentary-comedy": 1394,
    "1920s-1930s": 1395,
    "animated-sci-fi": 1396,
    "surreal-fantasy": 1397,
    "one-woman-show": 1398,
    "1981": 1399,
    "classic-horror": 1400,
    "airport-drama": 1401,
    "crisis-management": 1402,
    "airplane-drama": 1403,
    "action": 1404,
    "dystopian-western": 1405,
    "ai-rebellion": 1406,
    "social-allegory": 1407,
    "mutant-horror": 1408,
    "airborne-suspense": 1409,
    "dance-documentary": 1410,
    "performing-arts": 1411,
    "therapy-comedy": 1412,
    "disaster-comedy": 1413,
    "historical-horror": 1414,
    "journalistic-thriller": 1415,
    "female-ensemble": 1416,
    "reality-tv-parody": 1417,
    "undercover-crime": 1418,
    "1969": 1419,
    "philosophical-action": 1420,
    "multiple-eras": 1421,
    "fate-drama": 1422,
    "prison-comedy": 1423,
    "travel-drama": 1424,
    "misunderstanding-comedy": 1425,
    "punk-drama": 1426,
    "counterculture-film": 1427,
    "light-comedy": 1428,
    "literary-documentary": 1429,
    "artist-profile": 1430,
    "teen-survival": 1431,
    "techno-horror": 1432,
    "period-action": 1433,
    "monster-thriller": 1434,
    "1990s and 1940s": 1435,
    "afterlife-fantasy": 1436,
    "athlete-profile": 1437,
    "Napoleonic Wars era (early 1800s)": 1438,
    "adventure-horror": 1439,
    "supernatural": 1440,
    "cult-musical": 1441,
    "compilation-film": 1442,
    "b-movie-retrospective": 1443,
    "arctic-thriller": 1444,
    "body-snatcher": 1445,
    "atomic-age-sci-fi": 1446,
    "cold-war-paranoia": 1447,
    "underground-adventure": 1448,
    "naval-warfare": 1449,
    "anthropological-drama": 1450,
    "sci-fi-fan-culture": 1451,
    "spy-parody": 1452,
    "financial-drama": 1453,
    "multiple centuries": 1454,
    "comedy-documentary": 1455,
    "time-loop-thriller": 1456,
    "experimental-action": 1457,
    "romantic-crime": 1458,
    "fan-culture": 1459,
    "pop-culture": 1460,
    "creature-horror": 1461,
    "alternate 19th century": 1462,
    "steampunk-western": 1463,
    "raunchy-comedy": 1464,
    "found-footage": 1465,
    "paranormal-adventure": 1466,
    "cyborg-comedy": 1467,
    "disaster-movie": 1468,
    "urban-noir": 1469,
    "1st century BC": 1470,
    "epic-drama": 1471,
    "social-climbing": 1472,
    "psychic-adventure": 1473,
    "musical-horror": 1474,
    "bounty-hunter": 1475,
    "sci-fi-friendship": 1476,
    "backstage-comedy": 1477,
    "Edwardian England": 1478,
    "period-parody": 1479,
    "family-crime": 1480,
    "cinema-history": 1481,
    "retrospective": 1482,
    "disaster-parody": 1483,
    "parody-comedy": 1484,
    "disaster-spoof": 1485,
    "romantic-horror": 1486,
    "body-swap-fantasy": 1487,
    "mischief-comedy": 1488,
    "mafia-comedy": 1489,
    "teen-thriller": 1490,
    "cyborg-action": 1491,
    "horror": 1492,
    "friendship-comedy": 1493,
    "undercover-cop": 1494,
    "aerial-combat": 1495,
    "veteran-drama": 1496,
    "scientific-adventure": 1497,
    "balkan-comedy": 1498,
    "aviation-drama": 1499,
    "religious-horror": 1500,
    "psychedelic": 1501,
    "performance-art": 1502,
    "rock-n-roll": 1503,
    "college-horror": 1504,
    "arthurian-fantasy": 1505,
    "medieval-drama": 1506,
    "identity-mystery": 1507,
    "post-war-romance": 1508,
    "buddy-adventure": 1509,
    "martial-arts-action": 1510,
    "psychological-comedy": 1511,
    "espionage-drama": 1512,
    "18th-century Georgian England": 1513,
    "animal-companion": 1514,
    "1914": 1515,
    "historical-satire": 1516,
    "doppelganger-drama": 1517,
    "tropical-romance": 1518,
    "feudal Japan": 1519,
    "samurai-drama": 1520,
    "adult-drama": 1521,
    "workplace-documentary": 1522,
    "memory-thriller": 1523,
    "supernatural-western": 1524,
    "Old West (late 19th century)": 1525,
    "frontier-justice": 1526,
    "lawman-drama": 1527,
    "late-Qing-dynasty": 1528,
    "kung-fu-comedy": 1529,
    "traditional": 1530,
    "folkloric": 1531,
    "colonial-romance": 1532,
    "war-action": 1533,
    "ensemble-thriller": 1534,
    "tropical-adventure": 1535,
    "gambling-drama": 1536,
    "operatic-drama": 1537,
    "jungle-epic": 1538,
    "archival-footage": 1539,
    "motorcycle-racing": 1540,
    "character-portrait": 1541,
    "folk-horror": 1542,
    "14th-century": 1543,
    "eco-fantasy": 1544,
    "epic-adventure": 1545,
    "creative-partnership": 1546,
    "detective": 1547,
    "independent-filmmaking": 1548,
    "revenge-horror": 1549,
    "classic-silent": 1550,
    "workplace-romance": 1551,
    "adaptation": 1552,
    "space-comedy": 1553,
    "naval-drama": 1554,
    "wartime-satire": 1555,
    "prehistoric-adventure": 1556,
    "American Old West (19th century)": 1557,
    "class-swap": 1558,
    "summer-camp-comedy": 1559,
    "reunion-drama": 1560,
    "protest-drama": 1561,
    "mother-daughter-drama": 1562,
    "religious-comedy": 1563,
    "war-biography": 1564,
    "religious-epic": 1565,
    "claustrophobic-thriller": 1566,
    "ensemble-war": 1567,
    "educational-drama": 1568,
    "1820s-1830s": 1569,
    "wilderness-western": 1570,
    "longitudinal-study": 1571,
    "1799": 1572,
    "internet-history": 1573,
    "personal-narrative": 1574,
    "christmas-comedy": 1575,
    "father-son-drama": 1576,
    "16th-century Japan": 1577,
    "samurai-film": 1578,
    "revenge-tale": 1579,
    "frontier-drama": 1580,
    "early 20th century England": 1581,
    "inspirational": 1582,
    "late-1960s": 1583,
    "literacy-drama": 1584,
    "firefighter-drama": 1585,
    "horror-action": 1586,
    "computer-animation": 1587,
    "giallo": 1588,
    "jazz-drama": 1589,
    "anthology-comedy": 1590,
    "rockumentary": 1591,
    "sex-comedy": 1592,
    "early-1950s": 1593,
    "monster-fantasy": 1594,
    "ancient China (Warring States period)": 1595,
    "period-epic": 1596,
    "comic-adaptation": 1597,
    "Cold War era (1970s-1980s)": 1598,
    "old-west": 1599,
    "adventure-western": 1600,
    "serial-western": 1601,
    "post-war England (late 1940s/1950s)": 1602,
    "mythological": 1603,
    "sci-fi-parody": 1604,
    "crew-drama": 1605,
    "wildlife-documentary": 1606,
    "absurdist-drama": 1607,
    "maritime-thriller": 1608,
    "action-parody": 1609,
    "early-1980s": 1610,
    "erotic-horror": 1611,
    "relationship-thriller": 1612,
    "post-war 1960s": 1613,
    "counterculture-comedy": 1614,
    "coming-of-age-western": 1615,
    "counterculture-western": 1616,
    "observational-documentary": 1617,
    "wildlife-film": 1618,
    "monastic-comedy": 1619,
    "revolutionary-drama": 1620,
    "bodyguard-drama": 1621,
    "celebrity-protection": 1622,
    "1992 (with 1939 flashbacks)": 1623,
    "gender-studies": 1624,
    "disturbing-drama": 1625,
    "post-colonial India (1950s-1960s)": 1626,
    "dual-era (19th century and modern)": 1627,
    "teacher-student": 1628,
    "expedition-film": 1629,
    "financial-thriller": 1630,
    "sibling-drama": 1631,
    "public-health": 1632,
    "mystery-noir": 1633,
    "investigative-western": 1634,
    "psychological-western": 1635,
    "comedy-musical": 1636,
    "crisis-narrative": 1637,
    "wildlife-adventure": 1638,
    "gangster-noir": 1639,
    "hurricane-thriller": 1640,
    "space-exploration": 1641,
    "military-conflict": 1642,
    "atomic-horror": 1643,
    "splatter-horror": 1644,
    "wilderness-drama": 1645,
    "art-horror": 1646,
    "nature-documentary-style": 1647,
    "discovery-drama": 1648,
    "occult-drama": 1649,
    "afterlife-comedy": 1650,
    "late-1970s": 1651,
    "nostalgic": 1652,
    "post-Civil War": 1653,
    "mission-adventure": 1654,
    "late 19th century American West": 1655,
    "family-feud-drama": 1656,
    "frontier-conflict": 1657,
    "caper": 1658,
    "musical-biography": 1659,
    "post-Civil War American West (1860s-1870s)": 1660,
    "1902": 1661,
    "hard-sci-fi": 1662,
    "dream-narrative": 1663,
    "post-apocalyptic future": 1664,
    "entertainment-drama": 1665,
    "conspiracy-drama": 1666,
    "drug-cartel-thriller": 1667,
    "crime-adventure": 1668,
    "date-night": 1669,
    "Cold War era": 1670,
    "Napoleonic Wars (early 1800s)": 1671,
    "death-game": 1672,
    "nature-drama": 1673,
    "interracial-romance": 1674,
    "poetic-cinema": 1675,
    "kafkaesque": 1676,
    "race-relations": 1677,
    "claymation": 1678,
    "short-film": 1679,
    "vigilante-thriller": 1680,
    "illness-narrative": 1681,
    "comic-book-fantasy": 1682,
    "invasion-thriller": 1683,
    "teen-resistance": 1684,
    "cold-war-action": 1685,
    "team-drama": 1686,
    "1816": 1687,
    "gothic-fiction": 1688,
    "allegorical-adventure": 1689,
    "midlife-crisis": 1690,
    "late 1950s": 1691,
    "medieval-fantasy": 1692,
    "1500s": 1693,
    "camp-classic": 1694,
    "Old West (late 1800s)": 1695,
    "radiation-sci-fi": 1696,
    "1906": 1697,
    "train-thriller": 1698,
    "silent-era": 1699,
    "life-story": 1700,
    "race-relations-drama": 1701,
    "beach-party": 1702,
    "independent-comedy": 1703,
    "small-town-conflict": 1704,
    "experimental-comedy": 1705,
    "Edo period": 1706,
    "recovery-drama": 1707,
    "parallel-reality": 1708,
    "submarine-action": 1709,
    "prehistoric-fantasy": 1710,
    "business-drama": 1711,
    "provocative-drama": 1712,
    "mockumentary-style": 1713,
    "real-time-cinema": 1714,
    "youth-culture": 1715,
    "music-industry-drama": 1716,
    "rebellion-thriller": 1717,
    "comedy-caper": 1718,
    "tropical-western": 1719,
    "military-musical": 1720,
    "draft-dodging-comedy": 1721,
    "city-adventure": 1722,
    "travelogue-animation": 1723,
    "educational-children": 1724,
    "fairy-tale-musical": 1725,
    "survival": 1726,
    "1920s Soviet Russia": 1727,
    "electronic-music": 1728,
    "lgbtq-comedy": 1729,
    "funeral-drama": 1730,
    "1840s-1850s": 1731,
    "post-Civil War 1860s": 1732,
    "lawman-western": 1733,
    "sports-film": 1734,
    "war-adventure": 1735,
    "nazi-science-fiction": 1736,
    "prequel": 1737,
    "western-parody": 1738,
    "animal-hero": 1739,
    "rescue-drama": 1740,
    "visual-essay": 1741,
    "cinematic-poem": 1742,
    "noir-drama": 1743,
    "late-1970s-early-1980s": 1744,
    "vigilante-drama": 1745,
    "near-future": 1746,
    "action-survival": 1747,
    "romantic-sci-fi": 1748,
    "social-sci-fi": 1749,
    "witness-protection-thriller": 1750,
    "chase-adventure": 1751,
    "urban-culture": 1752,
    "Renaissance": 1753,
    "emotional-journey": 1754,
    "siege-thriller": 1755,
    "surveillance-drama": 1756,
    "1905": 1757,
    "revolutionary-epic": 1758,
    "escape-adventure": 1759,
    "1770s": 1760,
    "patriotic-epic": 1761,
    "institutional-horror": 1762,
    "alien-abduction": 1763,
    "paranormal-drama": 1764,
    "combat-thriller": 1765,
    "Vietnam War era": 1766,
    "musical-short-films": 1767,
    "cult-film": 1768,
    "shock-cinema": 1769,
    "slasher-spoof": 1770,
    "team-up": 1771,
    "interconnected-narrative": 1772,
    "frontier era": 1773,
    "sorority-comedy": 1774,
